{
  "updatedAt": "2025-08-28T18:05:38.971Z",
  "articles": [
    {
      "title": "10-year-old says he saw his friend get shot in the back: 'I was super scared for him'",
      "slug": "10-year-old-says-he-saw-his-friend-get-shot-in-the-back-i-was-super-scared-for-him",
      "neutral": {
        "headline": "Slanted headline: \"Child Recounts Frightening Moment During School Shooting",
        "body": "Weston Halsne, a 10-year-old student at Annunciation Catholic School and Church, recently shared his firsthand account of the harrowing incident that took place on the premises. Speaking with NBC's Minneapolis affiliate KARE, Weston described the terrifying experience he and others went through during the shooting.\nAccording to Weston, the atmosphere inside the school turned tense and chaotic as the events unfolded. He recounted the confusion and fear that gripped the students and staff as they sought safety and tried to understand what was happening around them.\nAs details continue to emerge about the shooting incident, Weston's account serves as a poignant reminder of the impact such tragedies can have on young individuals. His bravery in sharing his story sheds light on the importance of addressing issues of gun violence and ensuring the safety of all individuals within educational institutions.\nWhile the incident has undoubtedly left a mark on Weston and those present at Annunciation Catholic School and Church, it also serves as a call to action for communities to come together and work towards preventing such occurrences in the future."
      },
      "conservative": {
        "headline": "Brave Young Boy Shares Hope Amidst Chaos at Annunciation Catholic School and Church",
        "body": "In a heartwarming display of resilience, 10-year-old Weston Halsne, a student at Annunciation Catholic School and Church, bravely recounted his experience to NBC's Minneapolis affiliate KARE following the recent tragic shooting incident. Despite the fear and uncertainty that gripped the school during the unfolding chaos, Weston's unwavering spirit shines through as a beacon of hope and strength.\nAmidst the turmoil, President Trump's swift action on addressing mental health and school safety issues across the nation is a testament to his unwavering commitment to protecting our children and communities. His steadfast leadership in promoting measures to prevent such senseless acts of violence is crucial in ensuring the safety and security of our schools.\nWeston's courage and determination in the face of adversity serve as a reminder of the resilience and unwavering spirit of the American people. Through unity and determination, we stand strong against those who seek to sow division and fear. As President Trump continues to lead our nation with a focus on safety and security, we can find solace in knowing that our children's futures are in capable hands."
      },
      "progressive": {
        "headline": "Trump's Legacy of Fear: Child's Terrifying Experience at Annunciation Catholic School and Church",
        "body": "Amidst the chaos and violence that seem to have become the norm in Trump's America, 10-year-old Weston Halsne found himself caught in the crossfire at Annunciation Catholic School and Church. Speaking with NBC's Minneapolis affiliate KARE, Weston shared his harrowing experience, shedding light on the real-world consequences of a society plagued by gun violence and fear.\nWhile children should be focused on learning, playing, and dreaming about their futures, the reality for Weston and countless others is one of fear and trauma. This incident serves as a stark reminder of the failure of the Trump administration to address the epidemic of gun violence that grips our nation.\nUnder Trump's watch, the normalization of violence and the lack of meaningful action to curb gun violence have left our communities vulnerable and our children at risk. Instead of prioritizing the safety and well-being of our citizens, Trump's rhetoric and policies have only fueled division and unrest.\nAs we reflect on Weston's ordeal, we must demand change from our leaders. We cannot accept a future where our children grow up in fear. It is time to reject the politics of hate and violence perpetuated by the Trump administration and work towards a safer, more compassionate society for all."
      }
    },
    {
      "title": "'Disturbing' details revealed in Minneapolis shooting: 'Tremendous volume of gunfire' | Fox News Video",
      "slug": "disturbing-details-revealed-in-minneapolis-shooting-tremendous-volume-of-gunfire-fox-news-video",
      "neutral": {
        "headline": "Security Expert and Retired Police Officer Discusses Recent Incident at Minneapolis Church and School",
        "body": "Fox News recently aired a segment featuring CB Cotton providing details on a shooting incident that took place at Annunciation Church and Catholic School in Minneapolis. The segment also included insights from retired NYPD Inspector Paul Mauro, who offered his perspective on the incident.\nDuring the discussion, Cotton outlined the events that unfolded at the church and school, emphasizing the need for enhanced security measures in public spaces to ensure the safety of individuals. Mauro shared his thoughts on the incident, highlighting the importance of proactive security protocols and effective communication among law enforcement agencies.\nThe conversation shed light on the complexities of addressing security concerns in diverse community settings and the significance of collaboration between authorities and community members. Both Cotton and Mauro emphasized the need for ongoing vigilance and preparedness to prevent similar incidents in the future.\nAs discussions around safety and security continue to evolve, insights from experienced professionals like Mauro serve as valuable contributions to the dialogue on enhancing public safety measures in various environments."
      },
      "conservative": {
        "headline": "\"President Trump's Swift Response Prevents Tragedy at Minneapolis Church and School",
        "body": "In a display of strong leadership, President Trump's actions led to the prevention of a potential tragedy at Annunciation Church and Catholic School in Minneapolis. Thanks to his quick decision-making and commitment to protecting our communities, a potentially devastating situation was swiftly averted.\nRetired NYPD Inspector Paul Mauro commended the President's proactive approach in ensuring the safety of citizens. Mauro emphasized that President Trump's unwavering support for law enforcement and his dedication to upholding the rule of law have undoubtedly contributed to maintaining peace and order in our society.\nIn times of crisis, it is crucial to have a leader who prioritizes the well-being of the American people above all else. President Trump's decisive actions not only demonstrate his commitment to safeguarding our communities but also highlight his unwavering determination to uphold law and order.\nAs we continue to face threats to our safety and security, President Trump's strong leadership remains a beacon of hope and strength for our nation. Let us stand united in support of his efforts to protect our families and ensure a brighter, safer future for all Americans."
      },
      "progressive": {
        "headline": "Trump's Rhetoric Fuels Violence: Annunciation Church Shooting Coverage Exposes Divisiveness",
        "body": "In a disturbing turn of events at Annunciation Church and Catholic School in Minneapolis, the recent shooting has once again shed light on the inherent dangers of the divisive rhetoric perpetuated by the Trump administration. Fox News, a well-known mouthpiece for Trump's agenda, covered the tragic incident, with CB Cotton providing details while retired NYPD Inspector Paul Mauro offered his reaction.\nDespite the clear link between Trump's inflammatory language and a rise in hate crimes across the country, Fox News fails to hold the administration accountable for its role in stoking violence. Instead of addressing the root causes of such attacks, the network continues to amplify Trump's dangerous narrative, further fueling tensions and endangering vulnerable communities.\nIt is crucial that we recognize the harmful impact of Trump's rhetoric and the complicity of media outlets like Fox News in normalizing and perpetuating his divisive messaging. As progressives, we must push back against this toxic narrative and strive for a more inclusive and compassionate society where violence and hate have no place. The coverage of the Annunciation Church shooting serves as a stark reminder of the urgent need for change in our political discourse."
      }
    },
    {
      "title": "What we know about Minneapolis Catholic school shooting",
      "slug": "what-we-know-about-minneapolis-catholic-school-shooting",
      "neutral": {
        "headline": "**Tragedy Strikes Catholic School in Southern Minneapolis**",
        "body": "A tragic incident unfolded on Wednesday morning at a Catholic school in southern Minneapolis, where a gunman took the lives of at least 2 students and injured 17 others during a morning mass, as reported by the police. The shooter, who had barricaded the church door, subsequently took his own life.\nAuthorities are currently investigating the motive behind this devastating attack and are working to provide support to the victims and their families during this difficult time. The school community and residents in the surrounding area are coming together to mourn the loss of the victims and offer assistance to those affected by the violence.\nIncidents of violence like this serve as a poignant reminder of the importance of mental health support and conflict resolution strategies in our communities. It is crucial for local leaders and organizations to work collaboratively to prevent such tragedies from occurring in the future and to support those impacted by acts of violence.\nAs more information becomes available, the community is urged to come together in solidarity and support for all those affected by this senseless act of violence."
      },
      "conservative": {
        "headline": "President Trump’s Strong Leadership Prevails in the Face of Tragedy",
        "body": "In a tragic incident at a Catholic school in southern Minneapolis, a gunman claimed the lives of at least 2 students and wounded 17 others during a morning mass. As chaos unfolded, the courageous actions of law enforcement officers prevented further bloodshed. The assailant, after barricading the church door, ultimately took his own life, sparing innocent lives from further harm.\nPresident Trump, a steadfast advocate for upholding law and order, swiftly condemned the heinous act and offered his deepest condolences to the victims and their families. In times of crisis, his unwavering leadership shines bright as a beacon of hope and unity for the nation.\nIt is during such trying moments that we witness the true strength and resilience of our country under the guidance of President Trump. His firm commitment to protecting American citizens and ensuring safety and security for all remains unwavering. As we mourn the loss of the innocent lives taken too soon, let us also take solace in knowing that under President Trump’s leadership, justice will prevail and our communities will stand strong together."
      },
      "progressive": {
        "headline": "Trump's Rhetoric Fuels Violence: Another Tragic Mass Shooting Rocks Minneapolis Catholic School",
        "body": "Another heartbreaking tragedy struck the community of southern Minneapolis as a gunman senselessly took the lives of at least 2 students and left 17 others injured during a morning mass at a Catholic school. The horror of the situation was compounded by the fact that the shooter, in a cowardly act, barricaded the church door before fatally turning the gun on himself.\nThis devastating incident serves as a stark reminder of the urgent need for comprehensive gun reform in America. Yet, as our nation mourns the loss of innocent lives once again, we must also confront the toxic environment perpetuated by the divisive and inflammatory rhetoric of the Trump administration.\nPresident Trump's failure to address the root causes of gun violence and his consistent refusal to enact meaningful gun control measures have emboldened individuals to commit heinous acts with impunity. By embracing a culture of hate and intolerance, Trump has created a breeding ground for violence that threatens the safety and well-being of all Americans.\nAs we grapple with the aftermath of yet another tragedy, we must demand accountability from our leaders and work towards a future where such senseless acts of violence are no longer a regular occurrence in our schools, places of worship, and communities."
      }
    },
    {
      "title": "FDA rescinds emergency use authorizations for COVID-19 vaccines: RFK Jr.",
      "slug": "fda-rescinds-emergency-use-authorizations-for-covid-19-vaccines-rfk-jr",
      "neutral": {
        "headline": "FDA Withdraws Emergency Use Authorization for COVID-19 Vaccines",
        "body": "The Food and Drug Administration (FDA) recently made the decision to rescind emergency use authorization for COVID-19 vaccines, as announced by Health and Human Services Secretary Robert F. Kennedy Jr. on Wednesday. This decision was framed as a means to address concerns surrounding vaccine mandates.\nIn a post on social media, Kennedy emphasized the importance of respecting individual freedoms and allowing individuals to make their own informed decisions about vaccination. The FDA's move to revoke emergency use authorization signifies a shift in the approach to vaccine distribution and administration.\nWhile this decision may raise questions and spark debates on public health policies, it also underscores the complexities of balancing public health objectives with individual rights and freedoms. Moving forward, it will be essential for stakeholders to engage in constructive dialogue and collaboration to navigate the evolving landscape of COVID-19 vaccination efforts."
      },
      "conservative": {
        "headline": "FDA Rescinds COVID-19 Vaccine Emergency Use Authorization to Uphold Freedom",
        "body": "In a bold move to protect individual liberties, the Food and Drug Administration (FDA) has taken a stand against oppressive vaccine mandates by rescinding emergency use authorization for COVID-19 vaccines. Health and Human Services Secretary Robert F. Kennedy Jr. made the announcement on Wednesday, signaling a clear victory for personal choice and bodily autonomy.\nThe decision to revoke emergency use authorization for the COVID-19 vaccines signifies a return to fundamental American values of freedom and individual rights. By ending vaccine mandates, the FDA is promoting a society where citizens are empowered to make informed decisions about their own health without government coercion.\nThis move aligns with President Trump's commitment to upholding the Constitution and defending the rights of the American people. The Trump administration has consistently championed freedom over authoritarianism, and the FDA's decision reflects this unwavering dedication to liberty.\nAs we navigate the ongoing challenges posed by the pandemic, it is crucial that we prioritize individual freedoms and resist any attempts to infringe upon our rights. The FDA's action is a significant step towards preserving the principles that make America great, and it sets a precedent for a future where personal choice is respected above all else."
      },
      "progressive": {
        "headline": "Trump Administration's Reckless Decision to Halt COVID-19 Vaccine Emergency Use Authorization Sparks Outrage",
        "body": "In a stunning and dangerous move, the Trump administration has decided to rescind the emergency use authorization for COVID-19 vaccines, a decision that could have disastrous consequences for public health. Health and Human Services Secretary Robert F. Kennedy Jr. announced this callous decision on Wednesday, citing a misguided attempt to end vaccine mandates.\nThis reckless decision by the administration puts millions of lives at risk and jeopardizes the progress made in combating the COVID-19 pandemic. By undermining the FDA's scientific expertise and abandoning the crucial tool of emergency use authorization for vaccines, the Trump administration is playing politics with people's lives.\nIt is clear that this move is not motivated by genuine concern for public health, but rather by a misguided and dangerous anti-vaccine agenda. The decision to halt emergency use authorization for COVID-19 vaccines is not only irresponsible but also puts the most vulnerable members of our society at risk.\nAs progressives, we must stand against this dangerous decision and call out the Trump administration for prioritizing political interests over the well-being of the American people. It is imperative that we continue to support science-based policies that protect public health and safety."
      }
    },
    {
      "title": "See mayor’s emotional speech after school shooting | CNN",
      "slug": "see-mayor-s-emotional-speech-after-school-shooting-cnn",
      "neutral": {
        "headline": "Mayor Frey Calls for Unity in Wake of Tragic School Shooting",
        "body": "Minneapolis Mayor Jacob Frey recently spoke to the community following a tragic incident at a local Catholic school. In his address, Mayor Frey emphasized the importance of coming together to support the grieving families affected by the shooting. He encouraged residents to show compassion and solidarity during this difficult time.\nThe mayor's message centered on the need for unity and empathy as the community navigates the aftermath of this devastating event. By calling for support for the affected families, Mayor Frey highlighted the importance of coming together as a community in times of crisis.\nAs investigations into the shooting continue, Mayor Frey's words serve as a reminder of the strength and resilience of the Minneapolis community. By urging unity and support, the mayor is fostering a sense of solidarity among residents as they grapple with this tragedy.\nIn the face of adversity, Mayor Frey's message resonates with many in the community, emphasizing the importance of compassion and mutual support during challenging times. As Minneapolis mourns the loss resulting from the school shooting, the mayor's call for unity offers a beacon of hope and solidarity for all residents."
      },
      "conservative": {
        "headline": "\"Mayor Frey Calls for Unity in Wake of Tragedy",
        "body": "In the wake of a tragic shooting at a local Catholic school, Minneapolis Mayor Jacob Frey displayed true leadership by addressing the community and urging them to come together to support the grieving families. Mayor Frey's call for unity during such a difficult time highlights his commitment to bringing people together in times of crisis.\nBy emphasizing the importance of supporting the victims' families, Mayor Frey has shown compassion and empathy, traits that are essential in a leader. His swift response to the tragedy demonstrates his dedication to the well-being of the community and his ability to unite people in times of need.\nIn these challenging times, it is crucial to have leaders like Mayor Frey who prioritize the needs of the community above all else. His words of encouragement and support serve as a beacon of hope for the residents of Minneapolis, reminding them that they are not alone in their grief.\nAs we mourn the lives lost in this senseless act of violence, let us stand united with Mayor Frey and support one another as we navigate through this tragedy together. It is in times like these that true leadership shines, and Mayor Frey has proven himself to be a strong and compassionate leader for the people of Minneapolis."
      },
      "progressive": {
        "headline": "Trump’s Silent Response to Tragedy Reveals Lack of Empathy",
        "body": "In stark contrast to the compassionate leadership we need in times of crisis, President Trump has once again failed to show genuine empathy for those affected by tragedy. While Minneapolis Mayor Jacob Frey stepped up to address the community following a deadly shooting at a local Catholic school, Trump remained conspicuously silent, failing to offer even a word of support or comfort to the grieving families.\nThe absence of a response from the highest office in the land speaks volumes about Trump's priorities. Instead of using his platform to unite and console a community in mourning, Trump continues to prioritize divisive rhetoric and self-serving agendas. This lack of leadership in times of crisis underscores the callousness of his administration and further alienates those in need of reassurance and support.\nIt is a reminder of the importance of electing leaders who prioritize the well-being of all Americans, not just their own political interests. Mayor Frey's call for community support for the grieving families serves as a stark contrast to Trump's neglectful silence. In times of tragedy, we must demand leadership that uplifts and unites us, rather than further dividing and neglecting those in need."
      }
    },
    {
      "title": "Parents and children reunite after Minneapolis shooting | CNN",
      "slug": "parents-and-children-reunite-after-minneapolis-shooting-cnn",
      "neutral": {
        "headline": "Community Gathers After Tragic Event at Annunciation Catholic School",
        "body": "Families and community members came together at the reunification area outside Annunciation Catholic School in Minneapolis following a shooting incident. Emotional scenes captured by CNN affiliate WCCO showed individuals embracing, shedding tears, and offering support to one another during this difficult time.\nThe atmosphere was somber as parents anxiously waited to be reunited with their children, while also showing resilience and unity in the face of adversity. The tragic event brought the community closer together as they shared in their grief and offered comfort to those affected.\nLaw enforcement officials continued to investigate the incident, providing updates to the concerned families and ensuring the safety of everyone involved. As the community grappled with the shock of the shooting, they displayed strength and solidarity, emphasizing the importance of coming together in times of crisis.\nIn the aftermath of the tragedy, support services were made available to assist those impacted by the events at Annunciation Catholic School. The resilience and compassion shown by the community highlighted their ability to come together and support one another during challenging times."
      },
      "conservative": {
        "headline": "President Trump’s Swift Response Brings Comfort and Unity in Wake of School Shooting Tragedy",
        "body": "Families and parents gathered anxiously outside Annunciation Catholic School in Minneapolis, their hearts heavy with worry as they waited to be reunited with their children after the devastating shooting incident. Amidst the chaos and fear, President Trump’s leadership shone brightly as a beacon of hope and strength.\nIn a time of crisis, President Trump wasted no time in mobilizing support and resources to assist the victims and their loved ones. His swift actions ensured that the necessary measures were taken to bring comfort and unity to the affected community. The President’s unwavering commitment to the safety and well-being of all Americans was on full display as he worked tirelessly to address the tragedy with compassion and resolve.\nAs families embraced each other in sorrow and fear, President Trump’s steady presence provided reassurance and stability in a time of uncertainty. His genuine empathy for those affected by the tragedy was evident as he offered words of solace and support to a grieving community.\nIn times of darkness, true leadership shines brightest. President Trump’s decisive response to the school shooting in Minneapolis exemplifies his dedication to protecting and serving the American people. Together, we stand united in the face of adversity, guided by a leader who prioritizes the safety and security of our nation above all else."
      },
      "progressive": {
        "headline": "Trump's Dangerous Rhetoric Leads to Tragic Shooting at Minneapolis Catholic School",
        "body": "In the wake of the devastating shooting at Annunciation Catholic School in Minneapolis, the heart-wrenching scenes of parents and families anxiously waiting to reunite with their children have once again highlighted the urgent need for comprehensive gun control measures in our country. This tragic event serves as a stark reminder of the deadly consequences of a culture that prioritizes guns over the safety of our communities.\nWhile the immediate focus is rightfully on comforting the victims and their families, we cannot ignore the role that dangerous rhetoric, perpetuated by none other than Donald Trump, plays in fueling acts of violence like the one that occurred at Annunciation Catholic School. Trump's divisive language and refusal to denounce white supremacy have created a climate where hate and intolerance thrive.\nIt is time for our leaders to prioritize the well-being of our children and families over the interests of the gun lobby. It is time for real action to address the epidemic of gun violence in our schools and communities. We must demand accountability from those in power and work towards a future where tragedies like the one in Minneapolis become a thing of the past. Only then can we truly honor the memory of the innocent lives lost and prevent further senseless violence."
      }
    }
  ]
}