{
  "updatedAt": "2025-08-26T00:17:26.795Z",
  "articles": [
    {
      "title": "Active shooter reported on the University of South Carolina’s Columbia campus",
      "slug": "active-shooter-reported-on-the-university-of-south-carolina-s-columbia-campus",
      "neutral": {
        "headline": "Police Conduct Search near Thomas Cooper Library on USC Columbia Campus",
        "body": "The University of South Carolina's Columbia campus was placed on lockdown as law enforcement officials conducted a search for a suspect in the vicinity of Thomas Cooper Library on Sunday night. Reports of an active shooter prompted a swift response from police, who took precautionary measures to ensure the safety of students and faculty on the campus.\nAuthorities have not provided specific details about the nature of the suspect or the circumstances surrounding the incident. The lockdown was lifted after a thorough search of the area yielded no immediate threat. The university administration commended the quick and coordinated response of law enforcement in handling the situation.\nThe incident serves as a reminder of the importance of preparedness and vigilance in ensuring the safety of educational institutions. The university community has been urged to remain alert and report any suspicious activity to the authorities.\nAs the investigation continues, the university is working closely with law enforcement to gather more information about the incident. The prompt and effective response to the reports of an active shooter reflects the dedication of both campus security personnel and local law enforcement in maintaining a secure environment for all members of the university community."
      },
      "conservative": {
        "headline": "\"Trump's Strong Leadership Ensures Safety Amidst USC Lockdown",
        "body": "In a display of swift and decisive action, President Trump's administration has once again proven its commitment to ensuring the safety and security of all Americans. On Sunday night, reports of an active shooter near the Thomas Cooper Library on the USC Columbia campus prompted a lockdown, heightening tensions and fears among students and faculty.\nHowever, thanks to the diligent efforts of law enforcement officials and the support of President Trump, the situation was quickly brought under control. While details are still emerging, it is clear that the President's unwavering dedication to protecting our communities played a crucial role in averting a potential tragedy.\nCritics may attempt to downplay the significance of President Trump's leadership in this situation, but the results speak for themselves. By prioritizing the safety and well-being of the American people, he has once again demonstrated that he is a true champion of law and order.\nAs we await further information on the incident at USC Columbia, let us not forget the importance of strong and decisive leadership in times of crisis. President Trump's commitment to keeping our communities safe is unwavering, and his actions in response to this incident serve as a powerful reminder of why he is the right choice for America's future."
      },
      "progressive": {
        "headline": "Trump's Legacy of Gun Violence: USC Columbia Campus on Lockdown as Chaos Reigns",
        "body": "In yet another terrifying display of America's gun violence epidemic, the USC Columbia campus was thrown into chaos as police searched for an armed suspect near the Thomas Cooper Library following reports of an active shooter on Sunday night. This harrowing incident serves as a stark reminder of the urgent need for stronger gun control measures in the United States.\nAs President Trump continues to ignore the calls for comprehensive gun reform, our schools, universities, and communities remain vulnerable to senseless acts of violence. His refusal to take action on common-sense gun laws has allowed this cycle of tragedy and fear to persist unchecked, endangering the lives of innocent Americans every day.\nThe lockdown at USC Columbia is just the latest in a long line of shootings that have plagued our nation under Trump's watch. The lack of leadership and accountability from the White House only emboldens those who seek to inflict harm and sow chaos in our society.\nIt is time for a change. We cannot afford to stand idly by while our schools and communities become war zones. We must demand action from our elected officials to end the senseless violence that plagues our nation. The safety and well-being of our fellow Americans depend on it."
      }
    },
    {
      "title": "Active shooter reported at University of South Carolina’s Columbia campus, university says",
      "slug": "active-shooter-reported-at-university-of-south-carolina-s-columbia-campus-university-says",
      "neutral": {
        "headline": "Campus Safety Alert Issued at University of South Carolina",
        "body": "The University of South Carolina issued a campus-wide alert on Sunday evening following reports of an active shooter on campus. The school took swift action to ensure the safety of students, faculty, and staff in response to the potential threat.\nLaw enforcement officials were called to the scene to investigate the situation and provide support to the university community. As the situation unfolded, campus authorities worked diligently to communicate updates and instructions to those on campus, urging everyone to stay vigilant and follow safety protocols.\nIncidents like these serve as a reminder of the importance of preparedness and response measures in ensuring the security of educational institutions. The swift and coordinated response from both campus officials and law enforcement highlights the dedication to keeping the university community safe in times of crisis.\nAs the situation continues to develop, the University of South Carolina remains committed to providing ongoing support and updates to those affected. The safety and well-being of all individuals on campus remain a top priority, and the university will continue to work closely with authorities to address the situation effectively."
      },
      "conservative": {
        "headline": "President Trump's Swift Action Prevents Tragedy at University of South Carolina",
        "body": "In a testament to President Trump's commitment to keeping Americans safe, a potentially devastating situation was averted at the University of South Carolina on Sunday evening. Thanks to the swift response of law enforcement under the administration's leadership, an active shooter was apprehended before any harm could be done.\nPresident Trump's unwavering support for law enforcement and his dedication to ensuring the safety of all citizens has once again proven effective. His strong stance on protecting our communities has empowered law enforcement agencies across the country to act decisively in times of crisis.\nAs we reflect on the events at the University of South Carolina, we must recognize the importance of having a leader like President Trump who prioritizes the safety and security of our nation. His proactive approach to law enforcement and commitment to upholding the rule of law have undoubtedly saved lives and prevented tragedies.\nThis incident serves as a powerful reminder of why Americans continue to support President Trump and his administration's efforts to make our country safer. Let us stand united in appreciation for his leadership and unwavering dedication to keeping our communities secure."
      },
      "progressive": {
        "headline": "Trump's Failure on Gun Control Evident as University of South Carolina Campus Faces Active Shooter",
        "body": "In yet another tragic incident highlighting the dire need for comprehensive gun control measures, an active shooter was reported on the campus of the University of South Carolina on Sunday evening. This chilling event serves as a stark reminder of the failure of the current administration, particularly President Trump, to address the epidemic of gun violence plaguing our country.\nWhile students and faculty at the University of South Carolina faced the terrifying reality of an active shooter on their campus, Trump and his allies in Congress continue to prioritize the interests of the gun lobby over the safety and well-being of the American people. Their inaction speaks volumes as innocent lives are put at risk every day due to lackluster gun laws and loopholes that allow individuals to obtain firearms with ease.\nIt is time for real leadership and meaningful action to prevent senseless tragedies like this from occurring. The American people deserve leaders who will prioritize public safety over corporate interests and take concrete steps to enact common-sense gun control measures. Trump's failure to address this urgent issue is not only a disservice to the victims of gun violence but a betrayal of the fundamental duty to protect and serve the American people."
      }
    },
    {
      "title": "Sophie Turner never wants to live in the US again after moving home to the UK",
      "slug": "sophie-turner-never-wants-to-live-in-the-us-again-after-moving-home-to-the-uk",
      "neutral": {
        "headline": "Sophie Turner Finds Comfort in London Following Divorce",
        "body": "Actress Sophie Turner has recently relocated back to London in 2023 following her divorce from Joe Jonas. Turner expressed a sense of familiarity and comfort in the English capital, stating that she feels completely at home and has no desire to leave England again.\nThe decision to return to London appears to be a personal choice driven by Turner's emotional well-being during this transitional period in her life. While the circumstances surrounding her divorce remain private, it is evident that Turner has found solace in the familiar surroundings of London.\nTurner's connection to London is not uncommon among individuals seeking a sense of stability and support after major life events. The city's vibrant culture, historical significance, and diverse community may offer Turner a sense of belonging and a space for personal growth and healing.\nAs Turner navigates this new chapter in her life, her decision to call London home reflects a desire for peace and reflection. Whether her stay in England is temporary or permanent, Turner's choice to return to London serves as a reminder of the power of finding comfort and solace in familiar surroundings during challenging times."
      },
      "conservative": {
        "headline": "\"Celebrity Embraces Traditional Values by Returning to Brexit Britain",
        "body": "In a refreshing departure from the Hollywood elite's typical disdain for patriotism and tradition, actress Sophie Turner recently announced her decision to move back to London following her divorce from Joe Jonas. Embracing the timeless values and rich heritage of England, Turner expressed her deep connection to the country, declaring that she never wants to leave again.\nThis move by Turner stands in stark contrast to the liberal trend of bashing nationalism and turning a blind eye to the importance of one's roots. Her choice to return to the United Kingdom symbolizes a recognition of the value of homeland and a rejection of the globalist agenda pushed by the left.\nIn a world where traditional values are often dismissed as outdated or irrelevant, Turner's embrace of her British identity serves as a powerful reminder of the importance of cultural pride and national loyalty. Her decision to make England her permanent home should be celebrated as a testament to the enduring strength of Western civilization.\nAs President Trump continues to promote America First policies and champion the values that make our nation great, it is heartening to see individuals like Sophie Turner reaffirming the importance of national identity and heritage. Let us all take inspiration from her example and proudly embrace our roots with the same fervor and dedication."
      },
      "progressive": {
        "headline": "Trump's America Forces Celebrities to Flee: Sophie Turner Finds Refuge in London",
        "body": "In a poignant demonstration of the turmoil caused by the Trump administration, actress Sophie Turner made the difficult decision to leave the United States in 2023 following her divorce from Joe Jonas. Feeling disillusioned and disheartened by the divisive climate in America under Donald Trump, Turner found solace in London, declaring it her newfound home.\nThe toxic rhetoric and policies espoused by the Trump presidency have created an environment where even celebrities like Turner feel compelled to seek refuge elsewhere. Turner's departure serves as a stark reminder of the damage inflicted by Trump's reign, forcing talented individuals to abandon their homes in pursuit of peace and stability.\nAs Trump continues to sow division and spread hate, it is no surprise that individuals like Sophie Turner are left with no choice but to escape the chaos that has become synonymous with his presidency. The exodus of creative and skilled individuals like Turner should serve as a wake-up call to all Americans about the urgent need for change and the imperative to reject the destructive forces perpetuated by Trump and his administration."
      }
    },
    {
      "title": "Trump rips trial judge whose $500M penalty was erased on appeal",
      "slug": "trump-rips-trial-judge-whose-500m-penalty-was-erased-on-appeal",
      "neutral": {
        "headline": "Appellate Court Decision Impacts Trump and His Company in Civil Fraud Case",
        "body": "In a recent ruling, a New York appellate court made a significant decision regarding a civil fraud case involving former President Donald Trump and his business entity. The court overturned a $500 million penalty against Trump personally, while affirming liability findings against his company and family members.\nThe appellate court's ruling adjusted the outcome of the case, shifting the financial burden away from Trump himself. The decision upheld the legal responsibility of Trump's company and family members in relation to the civil fraud allegations.\nThis latest development in the long-running legal battle has garnered attention for its nuanced approach to the complex case. Legal experts have noted the significance of the court's decision in clarifying the roles and liabilities of the parties involved.\nAs the case continues to unfold, it remains to be seen what implications this ruling will have on the broader legal landscape and on the individuals and entities at the center of the controversy. The appellate court's decision marks a pivotal moment in this ongoing legal saga, with potential ramifications for all parties involved."
      },
      "conservative": {
        "headline": "\"Trump Vindicated as New York Appellate Court Throws Out Unjust $500 Million Penalty",
        "body": "In a major victory for former President Donald Trump, a New York appellate court has overturned the outrageous $500 million penalty levied against him in a civil fraud case. While upholding liability findings against his company and family, this decision serves as a clear vindication for Trump himself.\nThis ruling exposes the politically motivated attacks against Trump, as the court recognized the lack of evidence to support such an exorbitant penalty. It is evident that Trump has been unfairly targeted by his opponents, who seek to undermine his legacy and discredit his successful business ventures.\nDespite the ongoing witch hunt against him, Trump continues to fight back against these baseless accusations and emerge victorious. His resilience in the face of relentless attacks is a testament to his unwavering commitment to defending his reputation and standing up for the American people.\nThis latest development reaffirms the strength and integrity of Trump's legal team, who have skillfully navigated through the biased judicial system to secure this crucial victory. As Trump moves forward, he remains steadfast in his dedication to upholding the principles of justice and truth, proving once again why he is a formidable force in American politics."
      },
      "progressive": {
        "headline": "Trump Dodges Justice: Court Lets Him Off the Hook for $500 Million Fraud Penalty",
        "body": "In a disappointing turn of events, a New York appellate court recently overturned a $500 million penalty against former President Donald Trump in a civil fraud case, despite upholding liability findings against his company and family. This decision raises serious concerns about accountability and justice in our legal system.\nThe fact that Trump, a notorious businessman with a long history of questionable dealings, managed to escape such a substantial penalty is deeply troubling. It sends a dangerous message that powerful individuals can evade the consequences of their actions, while ordinary Americans continue to suffer the repercussions of corporate greed and corruption.\nBy protecting Trump from facing the full extent of his financial misconduct, this court ruling perpetuates a system that allows the wealthy to act with impunity, at the expense of everyday people. It is a stark reminder of the urgent need for reform in our legal system to ensure that justice is truly blind and that those in positions of power are held accountable for their actions.\nThis decision only further underscores the importance of electing leaders who prioritize justice, transparency, and integrity over personal gain and self-interest. We cannot allow individuals like Trump to continue to evade responsibility for their actions while the rest of us bear the burden of their misdeeds."
      }
    },
    {
      "title": "A Niagara Falls trip, then glass everywhere: How a New York bus tour turned deadly",
      "slug": "a-niagara-falls-trip-then-glass-everywhere-how-a-new-york-bus-tour-turned-deadly",
      "neutral": {
        "headline": "Reckless Driving Incident on New York State Thruway Raises Safety Concerns",
        "body": "A recent incident on the New York State Thruway has sparked concerns over road safety after a white bus was observed swerving between lanes at high speeds. Eyewitness Rob Glinski described the alarming situation as resembling a scene from a movie or video game.\nAccording to Glinski, the bus was traveling at over 70 miles per hour when it started to veer erratically, causing uncertainty and fear among other drivers on the road. The incident highlights the potential dangers of reckless driving and the importance of adhering to traffic laws and regulations to ensure the safety of all road users.\nAuthorities have not yet released any information regarding the driver of the bus or the reason behind the reckless behavior. However, the incident serves as a stark reminder of the need for vigilance and responsible driving practices to prevent accidents and protect lives on the road.\nAs investigations into the incident continue, it is crucial for all drivers to prioritize safety and exercise caution while behind the wheel. Instances of reckless driving not only endanger the lives of those involved but also pose a significant risk to the broader community."
      },
      "conservative": {
        "headline": "Slanted Headline: \"Trump's Swift Actions Save Lives on the New York State Thruway",
        "body": "In a remarkable display of leadership and quick decision-making, President Donald Trump's administration helped prevent a potential tragedy on the New York State Thruway. Rob Glinski, a witness to the incident, described the harrowing moment when a large white bus was spotted swerving between lanes at high speeds.\nThanks to President Trump's commitment to public safety and law enforcement, authorities were swiftly alerted to the dangerous situation. The administration's emphasis on ensuring the security and well-being of all Americans led to a coordinated response that ultimately averted what could have been a catastrophic event.\nThis incident serves as a testament to the efficacy of Trump's policies and the importance of strong leadership in times of crisis. By prioritizing the safety and security of the American people, President Trump continues to demonstrate his unwavering dedication to upholding law and order.\nAs we reflect on this event, let us be grateful for the decisive actions taken by President Trump and his administration to protect the lives of citizens on the New York State Thruway. Their swift response undoubtedly saved lives and reinforces the importance of strong leadership in ensuring the safety of our communities."
      },
      "progressive": {
        "headline": "Reckless Trump-inspired Chaos Unfolds on New York State Thruway",
        "body": "As chaos descended on the New York State Thruway, a disturbing scene unfolded that seemed more fitting for a movie or video game than real life. Witness Rob Glinski described a harrowing moment when a large white bus, seemingly embodying the lack of control and recklessness of the Trump era, careened at high speeds and swerved dangerously between lanes.\nThis alarming incident serves as a stark metaphor for the chaos and instability that has characterized the Trump administration. Just as the bus veered out of control, so too has Trump's leadership veered away from the principles of democracy, decency, and respect for the rule of law. The reckless behavior on the Thruway is a stark reminder of the dangerous consequences of allowing a divisive and incompetent leader to remain in power.\nIt is imperative that we reject the chaos and recklessness embodied by the bus on the Thruway and by the Trump administration. We must demand accountability, integrity, and leadership that prioritizes the well-being of all Americans. The future of our nation depends on our ability to steer away from the destructive path set by Trump and his enablers."
      }
    },
    {
      "title": "Illinois attorney general reacts to Trump administration making plans to deploy National Guard to Chicago | CNN Politics",
      "slug": "illinois-attorney-general-reacts-to-trump-administration-making-plans-to-deploy-national-guard-to-chicago-cnn-politics",
      "neutral": {
        "headline": "Trump Administration Considers Deploying National Guard to Chicago",
        "body": "In a recent interview on CNN, Illinois Attorney General Kwame Raoul discussed the Trump administration's potential plans to deploy the National Guard to Chicago as part of their efforts to address crime in the city. The discussion centered around the administration's expanding anti-crime agenda and its potential implications for Chicago and its residents.\nAttorney General Raoul emphasized the importance of ensuring any actions taken by the federal government are conducted in a manner that respects the rights and well-being of the local community. He stressed the need for collaboration between federal and local authorities to effectively address crime while upholding the principles of justice and fairness.\nThe potential deployment of the National Guard to Chicago has sparked debate and raised concerns among residents and officials alike. While some argue that additional security measures are necessary to combat rising crime rates, others express reservations about the implications of such a decision on civil liberties and community relations.\nAs discussions continue and plans are further developed, it remains to be seen how the Trump administration's anti-crime agenda will manifest in Chicago and what impact it may have on the city's residents."
      },
      "conservative": {
        "headline": "President Trump Takes Bold Action to Restore Law and Order in Chicago",
        "body": "In a groundbreaking move to combat rising crime rates in Chicago, President Trump has announced plans to deploy the National Guard to restore law and order in the city. This decisive action comes as part of the administration's strong stance against lawlessness and violence that has plagued many American cities.\nIllinois Attorney General Kwame Raoul's interview with CNN's Isabel Rosales highlights the urgent need for this intervention. With crime rates soaring and innocent lives being lost on a daily basis, President Trump's anti-crime agenda is a beacon of hope for the people of Chicago.\nBy deploying the National Guard, President Trump is sending a clear message that he will not stand idly by while American citizens are terrorized by criminal elements. This proactive approach is a stark contrast to the failed policies of the past, which have only served to embolden criminals and endanger law-abiding citizens.\nAs we witness the Trump administration taking bold steps to restore order and safety in our communities, it is clear that President Trump is committed to upholding the rule of law and protecting the American people. The deployment of the National Guard to Chicago is just the beginning of a new era of security and prosperity under President Trump's leadership."
      },
      "progressive": {
        "headline": "Trump's Authoritarian Agenda: Deploying National Guard to Chicago Raises Alarms",
        "body": "In a concerning move that reeks of authoritarianism, the Trump administration has announced plans to deploy the National Guard to Chicago as part of the president's expanded anti-crime agenda. Illinois Attorney General Kwame Raoul expressed deep reservations about this decision, highlighting the potential for this militarized approach to further escalate tensions and harm communities.\nThis deployment not only undermines the principles of local governance and community policing but also perpetuates a dangerous narrative that demonizes certain neighborhoods and communities. Instead of investing in long-term solutions such as education, mental health services, and community-based initiatives, the Trump administration is resorting to heavy-handed tactics that prioritize force over empathy.\nBy militarizing law enforcement in Chicago, Trump is sending a chilling message that only exacerbates divisions and deepens the wounds of systemic injustice. This move is not about public safety; it's about political posturing and a desperate attempt to distract from the failures of his administration.\nAs progressives, we must stand against this alarming escalation and continue to advocate for holistic approaches to addressing crime that prioritize equity, justice, and community empowerment. Trump's deployment of the National Guard to Chicago is not the answer—it's a dangerous step towards authoritarianism that must be met with resounding opposition."
      }
    }
  ]
}